silicone_tube_loss_scalar_transport/si_tube_4_9MM_ID_960MM_LEN_0_3LPM/Template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    axis
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          0;
        startFace       94055;
    }
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       94055;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       94080;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1920;
        startFace       94105;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          48000;
        startFace       96025;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          48000;
        startFace       144025;
    }
)

// ************************************************************************* //
