silicone_tube_loss_scalar_transport/si_tube_4_9MM_ID_960MM_LEN_0_3LPM/Template/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

// RAS
// {
//     // Tested with kEpsilon, realizableKE, kOmega, kOmega2006, kOmegaSST, v2f,
//     // ShihQuadraticKE, LienCubicKE.
//     model           kOmegaSST;

//     turbulence      on;

//     printCoeffs     on;
// }


// ************************************************************************* //
