silicone_tube_loss_scalar_transport/si_tube_4_9MM_ID_960MM_LEN_0_3LPM/Template/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    axis
    {
        type            symmetryPlane;
    }

    inlet           
    {
        type            calculated;
        value           uniform 0;

    }

    outlet          
    {
        type            calculated;
        value           uniform 0;
    }

    upperWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }

}


// ************************************************************************* //
