silicone_tube_loss_scalar_transport/si_tube_4_9MM_ID_960MM_LEN_0_3LPM/Template/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;
    type sets;

sets
(
    line_centreProfile
    {
        type    lineUniform;
        axis    distance;
        start           (0.1625 0 0);
        end             (0.1625 0.019 0);
        nPoints 100;
    }

    line_inletProfile
    {
        type    lineUniform;
        axis    distance;
        start           (0.125 0 0);
        end             (0.125 0.019 0);
        nPoints 100;
    }

    line_cylinderProfile
    {
        type    lineUniform;
        axis    distance;
        start           (0.275 0 0);
        end             (0.275 0.019 0);
        nPoints 100;
    }

);

fields          ( Ux);


// ************************************************************************* //
